
/*	1. 주석
		1. 한줄주석 : //
		2. 여러줄주석 :
	2. 출력 함수
		1. console.log('하고싶은말')
			: f12 개발자도구 console탭 출력되는 함수
		2. alert('하고싶은말')
			: 알람 메세지[확인] 출력하는 함수
		3. confirm('하고싶은말')
			: 알람 메세지[확인/취소] 출력하는 함수
		4. prompt('하고싶은말')
			: 입력하는 창을 출력하는 함수
		
		 	
	3. 데이터 자료형
		1. 문자 : '' or ""
		2. 숫자 : 200
		3. 논리 : true 혹은 false
		
*/

// 1. 출력
console.log('안녕 js')	// 1. 문자 입력 시 '' 사용
console.log("안녕 js2")  // 2.  문자 입력 시 "" 사용
console.log(200)		// 3. 숫자는 문자처리 x
console.log("200") 		// 4. "숫자"는 문자형식
console.log(true)		// 5. 논리형
console.log(20+"개")		// 6. 숫자+"문자" (+:연결연산자)
						// 문자 숫자 섞이면 문자가 됨
						
						
// 2. 출력
alert('안녕 js')
alert(20+20)			// 7. 숫자+숫자=숫자 (더하기 연산자) 40출력
alert("20"+20)			// 		문자+숫자=문자 출력


// 3. 출력
confirm('컨펌 js')		//

// 4. 입력
prompt('입력 js')











